CSI API ETABS v1
cPropLink.SetWeightAndMass Method
 Retrieves weight and mass data for a link property.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetWeightAndMass(
	string Name,
	double W,
	double M,
	double R1,
	double R2,
	double R3
)
Function SetWeightAndMass (
	Name As String,
	W As Double,
	M As Double,
	R1 As Double,
	R2 As Double,
	R3 As Double
) As Integer
Dim instance As cPropLink
Dim Name As String
Dim W As Double
Dim M As Double
Dim R1 As Double
Dim R2 As Double
Dim R3 As Double
Dim returnValue As Integer
returnValue = instance.SetWeightAndMass(Name,
	W, M, R1, R2, R3)
int SetWeightAndMass(
	String^ Name,
	double W,
	double M,
	double R1,
	double R2,
	double R3
)
abstract SetWeightAndMass :
        Name : string *
        W : float *
        M : float *
        R1 : float *
        R2 : float *
        R3 : float -> int
Parameters
Name
Type: System.String
The name of an existing link property.
W
Type: System.Double
The weight of the link. [F]
M
Type: System.Double
The translational mass of the link. [M]
R1
Type: System.Double
The rotational inertia of the link about its local 1 axis. [ML2]
R2
Type: System.Double
The rotational inertia of the link about its local 2 axis. [ML2]
R3
Type: System.Double
The rotational inertia of the link about its local 3 axis. [ML2]
Return Value
Type: Int32
returns zero if the data is successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim DOF() As Boolean
       Dim Fixed() As Boolean
       Dim Ke() As Double
       Dim Ce() As Double
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'add link property
       ReDim DOF(5)
       ReDim Fixed(5)
       ReDim Ke(5)
       ReDim Ce(5)
       DOF(0) = True
       Ke(0) = 12
       ret = SapModel.PropLink.SetLinear("L1", DOF, Fixed, Ke, Ce, 0, 0)
   'set link property weight and mass
       ret = SapModel.PropLink.SetWeightAndMass("L1", 10, 0.26, 0.0012, 0.0014, 0.0016)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropLink Interface
ETABSv1 Namespace